-- --------------------------------------------------------
-- Host:                         127.0.0.1
-- Server version:               8.0.30 - MySQL Community Server - GPL
-- Server OS:                    Win64
-- HeidiSQL Version:             12.1.0.6537
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

-- Dumping structure for table finalproject.admin_login
CREATE TABLE IF NOT EXISTS `admin_login` (
  `admin_id` int NOT NULL AUTO_INCREMENT,
  `admin_email` varchar(150) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `admin_password` varchar(150) DEFAULT NULL,
  PRIMARY KEY (`admin_id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- Dumping data for table finalproject.admin_login: ~1 rows (approximately)
INSERT INTO `admin_login` (`admin_id`, `admin_email`, `admin_password`) VALUES
	(1, 'raghad@gmail.com', 'raghad'),
	(3, 'dina@gmail.com', 'dina123');

-- Dumping structure for table finalproject.book
CREATE TABLE IF NOT EXISTS `book` (
  `bid` int unsigned NOT NULL AUTO_INCREMENT,
  `bname` varchar(150) DEFAULT NULL,
  `aname` varchar(150) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `bdesc` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `bdate` date DEFAULT NULL,
  `catname` varchar(150) DEFAULT NULL,
  `download` int DEFAULT '0',
  `bimg` varchar(150) DEFAULT NULL,
  `bpdf` varchar(150) DEFAULT NULL,
  PRIMARY KEY (`bid`)
) ENGINE=InnoDB AUTO_INCREMENT=36 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- Dumping data for table finalproject.book: ~18 rows (approximately)
INSERT INTO `book` (`bid`, `bname`, `aname`, `bdesc`, `bdate`, `catname`, `download`, `bimg`, `bpdf`) VALUES
	(18, 'الخيميائي', 'باولو كويلو', 'تتحدث الرواية عن راع أندلسي شاب يدعى سانتياغو. مضى للبحث عن حلمه المتمثل بكنزٍ مدفون قرب أهرامات مصر، بدأت رحلته من أسبانيا عندما إلتقى الملك &quot;ملكي صادق&quot; الذي أخبره عن الكنز، عَبَرَ مضيق جبل طارق ماراً بالمغرب حتى بلغ مصر، وكانت توجهه طوال الرحلة إشارات غيبية.\r\n\r\nوفي طريقه للعثور على كنزه الحلم، أحداث كثيرة تقع، كل حدث منها استحال عقبة تكاد تمنعه من متابعة رحلته، إلى أن يجد الوسيلة التي تساعده على تجاوز هذه العقبة', '1988-02-15', 'روايات', 2, 'الخيميائي.jpg', 'رواية الخيميائي.pdf'),
	(19, 'صاحب الظل الطويل', 'جين ويبستر', 'تحكي هذه الرواية مغامرة جودي آبوت التي خرجت من الميتم لان احد الاوصياء قرر التكفل بعملية تعليمها بعد ان لاحظ موهبتها الاستثنائية في الكتابة والكتابة الريفة تحديداً واصرارها على السعادة بصفتها خيارا في الحياة وليست حقا مكتسبا من الولادة', '1912-09-11', 'روايات', 0, 'صاحب الظل.jpg', 'صاحب الظل الطويل.pdf'),
	(20, 'أرض زيكولا', 'عمرو عبد الحميد', 'هل جرّبت أن تتعامل بعملة مختلفة عن العملات الورقية .. ليست معدنية وليست ذهبية ...الثروة هنا من نوع آخر ... لن تدفع مالاً لتأخذ ..بل ستدفع من ذكائك ..ستدفع من وحدات عقلك... ولكن انتبه فـ للثروة حدود ...فهنا المفلس لا يعامل باحتقار أو يُهان كما يحدث في عالمك .. بل يتعرض للموت .. احذر .. فأنت .. في أرض زيكولا', '2010-02-17', 'روايات', 0, 'ارض زيكولا.jpg', 'أرض زيكولا.pdf'),
	(21, 'ليطمئن قلبي', 'أدهم شرقاوي', 'ذهب الرازي يوما الى نيسابور فتراكض له الناس فقالت امرأة عجوز: من هذا؟ فقيل لها: هذا الرازي الذي يعرف ألف دليل على وجود الله\r\n\r\nفقالت: لو لم يكن في قلبه ألف شك ما احتاج الى ألف دليل!\r\nفلما بلغه قولها، قال: اللهم إيمانا كإيمان العجائز!\r\nهذه الرواية مهداة الى المؤمنين بالله إيمان العجائز بلا فلسفة ولا تعقيد..\r\nالذين لو قيل لأحدهم أعطنا دليلا على وجود الله لربما تلعثم ولم تسعفه لغته، ولكن ما يضره وحسبه من الإيمان أن كل خلية في جسمه تؤمن أن: لا إله إلا الله وأن محمداً رسول الله', '2019-05-14', 'روايات', 0, 'ليطمئن قلبي.jpg', 'ليطمئن قلبي.pdf'),
	(22, 'أثر الفراشة', 'محمود درويش', ' صفحات مختارة من يوميات، كُتبت بين صيف 2006 وصيف 2007 يضم الكتاب عشرات النصوص الشعرية التي تنقلنا من حلم إنساني إلى آخر. لكن أحلام محمود درويش غير إنها مثقلة بالواقع وأسيرة القضية.وهي أسيرة الخوف والقلق والحنين والرحيل والجدران..ولا تغادره المرأة بتاتاً', '2007-06-05', 'شعر', 0, 'أثر الفراشة.png', 'أثر الفراشة.pdf'),
	(23, 'ديوان الإمام الشافعي', 'الإمام الشافعي', 'عنى هذا الكتاب بجمع ديوان الإمام الشافعي وتبويبه تبعاً لحروف الهجاء وحركات الإعراب، والذي تناثرت أبياته ومقطعاته في مصارد شتى، أدبية ولغوية وتاريخية… وهذا الشعر يمثل نموذجاً لشاعرية رجل الفقه مجمله مروياً من هذين الينبوعين الدافقين ومن سيرة الراشدين وكبار الصحابة والأئمة\r\nديوان الامام الشافعي', '1900-09-11', 'شعر', 1, 'ديوان الإمام الشافعي.jpg', 'ديوان الشافعي.pdf'),
	(24, 'الشوقيات', 'أحمد شوقي', 'حوى آثارًا شعريةً مختلفةَ الأغراض والأهداف، وضمَّ مجموعةً من القصائد حول الوصف والغَزَل والرِّثاء؛ هذا الأخير الذي نَظَمه شوقي في تأبين زعماء مصر ورجالاتها الذين عاصرهم. كما تضمَّنَت الشوقيات إحياءَ ذكرى الخالدين من أعلام التاريخ بمآثرهم الإنسانية وعبقريَّتهم، وقد أرَّخ فيها شوقي لكثيرٍ من الأحداث والمناسبات، وحكى كثيرًا من الحكايات على ألسنة الطير والحيوانات.', '1926-09-28', 'شعر', 0, 'الشوقيات.jpg', 'الشوقيات.pdf'),
	(25, 'آلة الزمن', 'هربرت جورج ويلز', 'آلة الزمن هي أول رواية خيالية للكاتب هربرت جورج ويلز صدرت سنة 1895، عن عالم انتقل إلى المستقبل البعيد (حوالي 802,701 بعد الميلاد) ووجد كيف أن مستقبل البشرية مظلم، حيث أنه من خلال المسافة الطبقية بين الأغنياء والفقراء، سيظهر جنسين من البشر، كل جنس أحفاد لمن سبقوه فأحفاد الأغنياء سيكونون جنساَ غبياَ ضعيفأ يسمى (الأيلو)', '1895-06-30', 'خيال علمي', 0, 'آلة الزمن.jpg', 'آلة الزمن.pdf'),
	(26, 'كوكب العدم', 'أسامة محمد عارضة', 'الارض تعيش في زمن الصراع التي تنتهي الحضارة من حولها اكثر مما يتخيل الجميع بعضها صديق و بعضها عدو و هي سيدة في مجرتها قوية بين الاقوياء بفضل علومها و قادتها و  تكنولوجيتها  يسيطر على اكثر قليال من نصف إمبراطورتيها جاك القاسي العنيف عدو فراس الذي يتبع منظمة رقم صفر التي تسيطر على اقل بقليل من نصف امبراطورية الارض و الصراع ال ينتهي بينها و  بين من حولها او بين قادتها ', '2023-07-04', 'خيال علمي', 46, 'كوكب العدم.png', 'كوكب العدم.pdf'),
	(27, 'قوة التحكم في الذات', 'إبراهيم الفقي', 'معظم الناس يبرمجون منذ الصغر على أن يتصرفوا معينة ، ويشعر بأحاسيس سلبية من أسباب معينة ، بالتعاسة لأسباب معينة ، واستمروا في حياتهم بنفس التصرفات تماماً مثل الفيل نيلسون .. وأصبحوا سجناء برمجتهم واعتقاداتهم السلبية التي تحد من قدرتهم في الحصول على ما يستحقون في الحياة ، فنجد نسب الطلاق تزداد ارتفاعاً ، والشركات تغلق أبوابها', '2000-06-27', 'تنمية بشرية', 0, 'قوة التحكم في الذات.png', 'قوة التحكم في الذات.pdf'),
	(28, 'العادات الذرية', 'جيمس كلير', 'أيًا كانت أهدافك فإن كتاب &quot;العادات الذرية&quot; يقدم لك إطار عمل من أجل تطوير مهاراتك في كل يوم. جيمس كلير واحد من أبرز الخبراء في مجال اكتساب العادات، يوضح لنا في كتابه هذا استراتيجيات عملية تعلمنا كيف نستطيع اكتساب عادات جيدة، وكيف نتخلص من القديمة السلبية، ويشرح لنا طريقة إدارة وإتقان أفعالنا اليومية البسيطة التي نستطيع من خلالها تحقيق نتائج مذهلة.', '2019-06-11', 'تنمية بشرية', 1, 'العادات الذرية.jpg', 'العادات الذرية.pdf'),
	(29, 'فن اللامبالاة', 'مارك مانسون', 'ظل يُقال لنا طيلة عشرات السنوات إن التفكير الإيجابي هو المفتاح إلى حياة سعيدة ثرية. لكن مارك مانسون يشتم تلك &quot;الإيجابية&quot; ويقول: &quot; فلنكن صادقين، السيء سيء وعلينا أن نتعايش مع هذا &quot;. لا يتهرّب مانسون من الحقائق ولا يغلفها بالسكّر، بل يقولها لنا كما هي: جرعة من الحقيقة الفجِّة الصادقة المنعشة هي ما ينقصنا اليوم.', '2016-09-13', 'تنمية بشرية', 0, 'فن اللامبالاة.jpg', 'فن اللامبالاة.pdf'),
	(30, 'أسباب النزول', 'عبد الرحمن السيوطي جلال الدين', 'يُعتبر هذا الكتاب من أهم ما أُلِّف في الباب، ويتميَّز على كتاب الواحدي رحمه الله بالاختصار، والزيادات عليه، وعزو كل حديثٍ إلى من خرَّجه من أصحاب الكتب المعتبرة، وتمييز الصحيح من غيره، والمقبول من المردود، والجمع بين الروايات المتعددة، وتنحية ما ليس من أسباب النزول.', '1505-10-25', 'علوم القرآن', 0, 'اسباب النزول.jpg', 'أسباب_النزول.pdf'),
	(31, 'بلاغة القرآن في الإعجاز', 'بهجت عبد الواحد الشيخلي', 'يتناول الكتاب معنى كل سورة من القرآن الأربع عشرة بعد المائة، وجزاء الشرح حسب ترتيب الآيات في القرآن، من سورة البسملة إلى آخر سورة الناس، وإعراب آيات كل سورة إعرابًا تفصيليًا وافيًا ، مع تفسيرها وشرح الغامض.', '2001-06-11', 'علوم القرآن', 0, 'بلاغة القرآن.jpg', 'بلاغة_القرآن_الكريم_في_الإعجاز.pdf'),
	(32, 'لغز وادي المساخيط', 'محمود سالم', 'المغامرون الخمسة سلسلة مغامرات بوليسية، صدرت عن دار المعارف في السبعينيات أبطالها تختخ ولوزة ومحب ونوسة الذين رافقوا أجيالا متعاقبة في الوطن العربي، وقد صدر منها عشرات الكتب وقدمت في عدة مسلسلات كرتونية ، عن السلسلة يقول المؤلف أعتقد أن المغامرين الخمسة هي نوع من استعادة شجون وذكريات طفل متوحد ومنعزل.', '1976-06-08', 'قصص أطفال', 0, 'لغز وادي المساخيط.jpg', 'لغز_وادى_المساخيط.pdf'),
	(33, 'لغز عصابة الأشباح', 'محمود سالم', 'إنهم أشباح طوال القامة ، وفى لحظات يتحولون إلى أشباح قصار القامة ، ثم يتلاشون فلا يجدهم أحد .\r\nوقد اكتشف الشاويش " فرقع " أن " تختخ " و " محب " و " عاطف " فى هذه العصابة !\r\nاقرأ اللغز وحاول أن تكشف سر العصابة مع المغامرين الخمسة .', '2023-06-26', 'قصص أطفال', 0, 'عصابة الأشباح.jpg', 'لغز_عصابة_الأشباح.pdf'),
	(34, 'مطبخ منال العالم', 'منال العالم', 'الشيف &quot;منال العالم&quot; سعت لتقدم الفنون لهذه الأم حيث اعتنت بوضع كتاب حمل إسمها وحملت صفحاته ألذ وأطيب الوصفات من المطبخ العربي والغربي، والأكثر شهرة، فكانت هذه التشكيلة من الوصفات المختارة، والوصفات التقليدية، الشعبية، العالمية، العربية والغربية، حيث أتاحت لربة المنزل ولكل هواة الطبخ فرصة لإعداد مائدة متكاملة ترضي كافة الأذواق وهي لم تكتف بتقديم كتابها هذا بل أطلت من خلال البرامج التليفزيونية التي قدمتها على الشاشات العربية المتنوعة', '2016-07-28', 'طبخ وطعام', 0, 'منال.jpg', 'منال العالم.pdf'),
	(35, 'أشهى الحلويات', 'السيدة بو حامد', 'كتاب أشهى الحلويات تأليف السيدة بو حامد يقدم وصفات جديدة و مميزة فى عالم طهى بو حامد فى أشهى الحلويات، موضحة من خلال الكتاب مكونات كل نوع من الحلويات وطريقة عمله، كما تقدم أنواع متعددة من الحلويات الغربية ليست فقط الحلوى العربية و الشرقية.', '2023-01-03', 'طبخ وطعام', 0, 'اشهى الحلوياات.jpg', 'اشهى الحلويات.pdf');

-- Dumping structure for table finalproject.category
CREATE TABLE IF NOT EXISTS `category` (
  `cid` int unsigned NOT NULL AUTO_INCREMENT,
  `cname` varchar(150) NOT NULL DEFAULT '0',
  PRIMARY KEY (`cid`)
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- Dumping data for table finalproject.category: ~3 rows (approximately)
INSERT INTO `category` (`cid`, `cname`) VALUES
	(1, 'شعر'),
	(2, 'روايات'),
	(4, 'خيال علمي'),
	(19, 'تنمية بشرية'),
	(20, 'علوم القرآن'),
	(21, 'قصص أطفال'),
	(22, 'طبخ وطعام');

-- Dumping structure for table finalproject.contact
CREATE TABLE IF NOT EXISTS `contact` (
  `contid` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '',
  `email` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '',
  `title` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '',
  `message` varchar(1000) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`contid`)
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- Dumping data for table finalproject.contact: ~5 rows (approximately)
INSERT INTO `contact` (`contid`, `name`, `email`, `title`, `message`) VALUES
	(1, 'asdd', 'dd@gmail.com', 'hjgfds', 'hjgfdsagfd'),
	(3, 'insaf', 'insafh@gmail.com', 'اعتراض', 'زهقت'),
	(4, 'انصاف', 'insafh@gmail.com', 'اعتراض', 'iiii'),
	(5, 'انصاف', 'insafh@gmail.com', 'اعتراض', 'iiiiiiiiiiiiiiii'),
	(6, 'insaf', 'insafh@gmail.com', 'اعتراض', 'iii'),
	(7, 'ee', 'roumyinsaf119@gmail.com', 'اعتراض', 'iiii'),
	(8, 'insaf', 'insafh@gmail.com', 'شكر', 'شكرا'),
	(9, 'hgk hkg', 'i119@gmail.com', 'شكر', 'شكرا كثيرا '),
	(10, 'hgk hkg', 'i119@gmail.com', 'شكر', 'شكرا كثيرا '),
	(11, 'hgk hkg', 'i119@gmail.com', 'شكر', 'شكرا كثيرا '),
	(12, 'qqq www eee', 'i119@gmail.com', 'اعتراض', 'اعترض'),
	(13, 'www eee', 'i119@gmail.com', 'اعتراض', 'مرحبا انا اعترض'),
	(14, 'uifh tt', 'i119@gmail.com', 'سلام', 'سلام عليكم');

-- Dumping structure for table finalproject.copyright
CREATE TABLE IF NOT EXISTS `copyright` (
  `id` int NOT NULL AUTO_INCREMENT,
  `copytext` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- Dumping data for table finalproject.copyright: ~2 rows (approximately)
INSERT INTO `copyright` (`id`, `copytext`) VALUES
	(1, 'في موقع مكتبة سحاب،  خصوصية زوارنا لها أهمية بالغة بالنسبة لنا. وثيقة سياسة الخصوصية هذه تحدد الخطوط\r\n                    العريضة لأنواع المعلومات الشخصية التي تتلقاها وتجمعها مكتبة سحاب وكيفية استخدامها.\r\n\r\n                    مثل الكثير من المواقع على شبكة الانترنت، تستخدم مكتبة سحاب ملفات الدخول. المعلومات داخل ملفات الدخول\r\n                    تشمل:\r\n                    بروتوكول الإنترنت، وعناوين(IP)، نوع المتصفح، مزود خدمة الانترنت (مقدمي خدمات الانترنت)، والتاريخ /\r\n                    خواتم\r\n                    الوقت، مصادر الزيارات / الخروج الصفحات، وعدد النقرات لتحليل الاتجاهات وإدارة الموقع ومراقبة المستخدم\r\n                    أثناء التنقل في أرجاء المدونة، وجمع المعلومات الديموغرافية. عناوين بروتوكول الإنترنت، وغيرها من مثل\r\n                    هذه\r\n                    المعلومات ليست مرتبطة بأية معلومات لتحديد هويتك.\r\n                    في موقع مكتبة سحاب، خصوصية زوارنا لها أهمية بالغة بالنسبة لنا. وثيقة سياسة الخصوصية هذه تحدد الخطوط\r\n                    العريضة لأنواع المعلومات الشخصية التي تتلقاها وتجمعها مكتبة سحاب وكيفية استخدامها.\r\n\r\n                    مثل الكثير من المواقع على شبكة الانترنت، تستخدم مكتبة سحاب ملفات الدخول. المعلومات داخل ملفات الدخول\r\n                    تشمل:\r\n                    بروتوكول الإنترنت، وعناوين(IP)، نوع المتصفح، مزود خدمة الانترنت (مقدمي خدمات الانترنت)، والتاريخ /\r\n                    خواتم\r\n                    الوقت، مصادر الزيارات / الخروج الصفحات، وعدد النقرات لتحليل الاتجاهات وإدارة الموقع ومراقبة المستخدم\r\n                    أثناء التنقل في أرجاء المدونة، وجمع المعلومات الديموغرافية. عناوين بروتوكول الإنترنت، وغيرها من مثل\r\n                    هذه\r\n                    المعلومات ليست مرتبطة بأية معلومات لتحديد هويتك.');

-- Dumping structure for table finalproject.policy
CREATE TABLE IF NOT EXISTS `policy` (
  `id` int NOT NULL AUTO_INCREMENT,
  `policytext` text,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- Dumping data for table finalproject.policy: ~2 rows (approximately)
INSERT INTO `policy` (`id`, `policytext`) VALUES
	(1, 'سياسة الخصوصية لموقع مكتبة سحاب : \r\n                        نحن في مكتبة سحاب نهتم بخصوصية زوارنا ونحرص على حماية معلوماتهم الشخصية. توضح سياسة الخصوصية\r\n                        التالية كيفية جمعنا واستخدامنا للمعلومات الشخصية التي يتم تقديمها لنا عند استخدامك لموقعنا.\r\n                        \r\n                        جمع المعلومات: \r\n                        نقوم بجمع معلومات شخصية محددة عندما تتفاعل معنا على الموقع، مثل عنوان البريد الإلكتروني عندما\r\n                        تشترك في النشرة الإخبارية أو تقدم طلبًا للاشتراك.\r\n                        نستخدم تقنيات مثل ملفات تعريف الارتباط (الكوكيز) لجمع معلومات حول استخدامك للموقع، وتحسين تجربتك\r\n                        وتخصيص المحتوى.\r\n                        \r\n                        استخدام المعلومات:\r\n                        نستخدم المعلومات الشخصية التي نجمعها لتقديم الخدمات والمحتوى المطلوب، وتحسين وتخصيص تجربتك على\r\n                        الموقع.\r\n                        قد نستخدم المعلومات للتواصل معك بخصوص المستجدات والعروض والأخبار المتعلقة بالموقع، وذلك فقط إذا\r\n                        وافقت على ذلك.\r\n                        \r\n                        حماية المعلومات:&gt;\r\n                        نحمي المعلومات الشخصية التي تقدمها لنا بواسطة إجراءات أمنية ملائمة للوقاية من الوصول غير المصرح\r\n                        به أو الاستخدام أو الكشف عنها.\r\n                        نحتفظ بالمعلومات الشخصية فقط للفترة الزمنية اللازمة لتحقيق الأغراض التي جمعت من أجلها، ما لم\r\n                        يُطلب منا الاحتفاظ بها لفترة أطول بموجب القانون.\r\n                        \r\n                        الكشف عن المعلومات:&gt;\r\n                        لا نقوم ببيع أو تأجير أو مشاركة المعلومات الشخصية التي نحصل عليها مع أي جهة خارجية، ما لم يكن\r\n                        لدينا إذن صريح منك أو يكون هناك طلب قانوني للكشف عنها.\r\n                        قد نقوم بمشاركة المعلومات الشخصية مع مقدمي الخدمات الذين يعملون باسمنا لتسهيل عملياتنا وتوفير\r\n                        الخدمات المطلوبة، ولكن يلتزمون بعدم استخدام تلك المعلومات لأي غرض آخر.\r\n                        قد نقوم بالكشف عن المعلومات الشخصية إذا اعتقدنا بحسن نية أن ذلك ضروري للامتثال للقوانين\r\n                        والتنظيمات السارية أو لحماية حقوقنا وسلامتنا أو حقوق المستخدمين الآخرين.\r\n                        \r\n                        حقوق الزائر:\r\n                        لديك الحق في الوصول إلى المعلومات الشخصية التي لدينا عنك وتحديثها أو حذفها إذا كانت غير صحيحة أو\r\n                        غير محدثة.\r\n                        يمكنك ممارسة حقوقك عن طريق الاتصال بنا عبر المعلومات المتاحة في صفحة اتصل بنا.');

-- Dumping structure for table finalproject.setting
CREATE TABLE IF NOT EXISTS `setting` (
  `id` int NOT NULL AUTO_INCREMENT,
  `lname` varchar(150) DEFAULT NULL,
  `logo` varchar(250) DEFAULT NULL,
  `lface` varchar(250) DEFAULT NULL,
  `ltwitter` varchar(250) DEFAULT NULL,
  `linsta` varchar(250) DEFAULT NULL,
  `lyoutube` varchar(250) DEFAULT NULL,
  `lemail` varchar(250) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- Dumping data for table finalproject.setting: ~0 rows (approximately)
INSERT INTO `setting` (`id`, `lname`, `logo`, `lface`, `ltwitter`, `linsta`, `lyoutube`, `lemail`) VALUES
	(6, 'مكتبة سحاب', 'logo1b.png', 'https://www.facebook.com', 'https://www.twitter.com', 'https://www.instagram.com', 'https://www.youtube.com', 'infoLibrary@book.com');

-- Dumping structure for table finalproject.users
CREATE TABLE IF NOT EXISTS `users` (
  `id` int NOT NULL AUTO_INCREMENT,
  `full_name` varchar(150) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `email` varchar(150) DEFAULT NULL,
  `password` varchar(150) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- Dumping data for table finalproject.users: ~0 rows (approximately)
INSERT INTO `users` (`id`, `full_name`, `email`, `password`) VALUES
	(5, 'insaf', 'insafh@gmail.com', '$2y$10$lXqgcXZWmh.dAgrt8YH3VuPho4Fa8UXiuVY8k3CCsR8hrtZjqKYiy'),
	(6, 'insafh', 'insafh2@gmail.com', '$2y$10$S331jIUJeBrSaXk4D9Wm/.8NMWbAEzNvs9jiWK.BE47ipeLWCOpG.');

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
